[
    {
        "characters": [
            "George Lucas"
        ],
        "description": "A Star Wars Film",
        "director": "George Lucas",
        "episode_id": "A New Hope",
        "id": 1,
        "opening_crawl": "It is a period of civil war. Rebel spaceships, striking from a hidden base, have won their first victory against the evil Galactic Empire.  During the battle, Rebel spies managed to steal secret plans to the Empire`s ultimate weapon, the DEATH STAR, an armored space station with enough power to destroy an entire planet.  Pursued by the Empire`s sinister agents, Princess Leia races home aboard her starship, custodian of the stolen plans that can save her people and restore freedom to the galaxy....",
        "planets": [
            "1,2,3"
        ],
        "producer": "Gary Kurtz, Rick McCallum",
        "species": [
            "1,2,3,4,5"
        ],
        "starships": [
            "2,3,5,9,10,11,12,13"
        ],
        "title": "A New Hope",
        "vehicles": [
            "4,6,7,8"
        ]
    },
    {
        "characters": [
            "Irvin Kershner"
        ],
        "description": "A Star Wars Film",
        "director": "Irvin Kershner",
        "episode_id": "The Empire Strikes Back",
        "id": 2,
        "opening_crawl": "It is a dark time for the Rebellion. Although the Death Star has been destroyed, Imperial troops have driven the Rebel forces from their hidden base and pursued them across the galaxy.  Evading the dreaded Imperial Starfleet, a group of freedom fighters led by Luke Skywalker has established a new secret base on the remote ice world of Hoth.  The evil lord Darth Vader, obsessed with finding young Skywalker, has dispatched thousands of remote probes into the far reaches of space....",
        "planets": [
            "4,5,6,27"
        ],
        "producer": "Gary Kurtz, Rick McCallum",
        "species": [
            "1,2,3,6,7"
        ],
        "starships": [
            "3,10,11,12,15,17,21,22,23"
        ],
        "title": "The Empire Strikes Back",
        "vehicles": [
            "8,14,16,18,19,20"
        ]
    },
    {
        "characters": [
            "Richard Marquand"
        ],
        "description": "A Star Wars Film",
        "director": "Richard Marquand",
        "episode_id": "Return of the Jedi",
        "id": 3,
        "opening_crawl": "Luke Skywalker has returned to his home planet of Tatooine in an attempt to rescue his friend Han Solo from the clutches of the vile gangster Jabba the Hutt.  Little does Luke know that the GALACTIC EMPIRE has secretly begun construction on a new armored space station even more powerful than the first dreaded Death Star.  When completed, this ultimate weapon will spell certain doom for the small band of rebels struggling to restore freedom to the galaxy...",
        "planets": [
            "1,5,7,8,9"
        ],
        "producer": "Howard G. Kazanjian, George Lucas, Rick McCallum",
        "species": [
            "1,2,3,5,6,8,9,10,15"
        ],
        "starships": [
            "2,3,10,11,12,15,17,22,23,27,28,29"
        ],
        "title": "Return of the Jedi",
        "vehicles": [
            "8,16,18,19,24,25,26,30"
        ]
    },
    {
        "characters": [
            "George Lucas"
        ],
        "description": "A Star Wars Film",
        "director": "George Lucas",
        "episode_id": "The Phantom Menace",
        "id": 4,
        "opening_crawl": "Turmoil has engulfed the Galactic Republic. The taxation of trade routes to outlying star systems is in dispute.  Hoping to resolve the matter with a blockade of deadly battleships, the greedy Trade Federation has stopped all shipping to the small planet of Naboo.  While the Congress of the Republic endlessly debates this alarming chain of events, the Supreme Chancellor has secretly dispatched two Jedi Knights, the guardians of peace and justice in the galaxy, to settle the conflict....",
        "planets": [
            "1,8,9"
        ],
        "producer": "Rick McCallum",
        "species": [
            "1,2,6,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27"
        ],
        "starships": [
            "31,32,39,40,41"
        ],
        "title": "The Phantom Menace",
        "vehicles": [
            "33,34,35,36,37,38,42"
        ]
    },
    {
        "characters": [
            "George Lucas"
        ],
        "description": "A Star Wars Film",
        "director": "George Lucas",
        "episode_id": "Attack of the Clones",
        "id": 5,
        "opening_crawl": "There is unrest in the Galactic Senate. Several thousand solar systems have declared their intentions to leave the Republic.  This separatist movement, under the leadership of the mysterious Count Dooku, has made it difficult for the limited number of Jedi Knights to maintain  peace and order in the galaxy.  Senator Amidala, the former Queen of Naboo, is returning to the Galactic Senate to vote on the critical issue of creating an ARMY OF THE REPUBLIC to assist the overwhelmed Jedi....",
        "planets": [
            "1,8,9,10,11"
        ],
        "producer": "Rick McCallum",
        "species": [
            "1,2,6,12,13,15,28,29,30,31,32,33,34,35"
        ],
        "starships": [
            "21,32,39,43,47,48,49,52,58"
        ],
        "title": "Attack of the Clones",
        "vehicles": [
            "4,44,45,46,50,51,53,54,55,56,57"
        ]
    },
    {
        "characters": [
            "George Lucas"
        ],
        "description": "A Star Wars Film",
        "director": "George Lucas",
        "episode_id": "Revenge of the Sith",
        "id": 6,
        "opening_crawl": "War! The Republic is crumbling under attacks by the ruthless Sith Lord, Count Dooku. There are heroes on both sides. Evil is everywhere.  In a stunning move, the fiendish droid leader, General Grievous, has swept into the Republic capital and kidnapped Chancellor Palpatine, leader of the Galactic Senate.  As the Separatist Droid Army attempts to flee the besieged capital with their valuable hostage, two Jedi Knights lead a desperate mission to rescue the captive Chancellor....",
        "planets": [
            "1,2,5,8,9,12,13,14,15,16,17,18,19"
        ],
        "producer": "Rick McCallum",
        "species": [
            "1,2,3,6,15,19,20,23,24,25,26,27,28,29,30,33,34,35,36,37"
        ],
        "starships": [
            "2,32,48,59,61,63,64,65,66,68,74,75"
        ],
        "title": "Revenge of the Sith",
        "vehicles": [
            "33,50,53,56,60,62,67,69,70,71,72,73,76"
        ]
    }
]